package com.autoai.mylivedata.model.bean;

import java.util.List;

/**
 * @author : YangHaoYi on  2019/5/2111:14.
 * Email  :  yang.haoyi@qq.com
 * Description :请求数据Bean
 * Change : YangHaoYi on  2019/5/2111:14.
 * Version : V 1.0
 */
public class PoetryData {
    /**
     * code : 200
     * message : 成功!
     * result : [{"name":"李白","desc":"李白，字太白，陇西成纪人，凉武昭王暠九世孙。或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心。初隐岷山，益州长史苏颋见而异之曰：\u201c是子天才英特，可比相如。\u201d天宝初，至长安，往见贺知章。知章见其文，叹曰：\u201c子谪仙人也。\u201d言于明皇，召见金銮殿，奏颂一篇。帝赐食，亲为调羹。有诏供奉翰林，白犹与酒徒饮于巿。帝坐沈香亭子，意有所感，欲得白为乐章，召入，而白已醉。左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见。白常侍帝，醉，使高力士脱𫖇。力士素贵，耻之，摘其诗以激杨贵妃。帝欲官白，妃辄沮止。白自知不为亲近所容，恳求还山。帝赐金放还，乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐。璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之。代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。 李白，字太白，陇西成纪人，凉武昭王暠九世孙，或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心。初隐岷山，益州长史苏颋见而异之曰：\u201c是子天才英特，可比相如。\u201d天宝初，至长安，往见贺知章。知章见其文，叹曰：\u201c子谪仙人也。\u201d言于明皇，召见金銮殿，奏颂一篇，帝赐食，亲为调羹，有诏供奉翰林。白犹与酒徒饮于巿，帝坐沈香亭子，意有所感，欲得白为乐章。召入，而白已醉。左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见。白常侍帝，醉，使高力士脱𫖇。力士素贵，耻之，摘其诗以激杨贵妃。帝欲官白，妃辄沮止。白自知不为亲近所容，恳求还山，帝赐金放还。乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐。璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之。代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。 李白，字太白，陇西成纪人，凉武昭王暠九世孙，或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心，初隐岷山，益州长史苏颋见而异之曰，是子天才英特，可比相如。天宝初，至长安，往见贺知章，知章见其文，叹曰，子谪仙人也。言于明皇，召见金銮殿，奏颂一篇，帝赐食，亲为调羹，有诏供奉翰林。白犹与酒徒饮于巿，帝坐沈香亭子，意有所感，欲得白为乐章，召入，而白已醉，左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见，白常侍帝，醉，使高力士脱𫖇，力士素贵，耻之，摘其诗以激杨贵妃，帝欲官白，妃辄沮止，白自知不为亲近所容，恳求还山，帝赐金放还，乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐，璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之，代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。 李白，字太白，陇西成纪人，凉武昭王暠九世孙，或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心，初隐岷山，益州长史苏颋见而异之曰，是子天才英特，可比相如。天宝初，至长安，往见贺知章，知章见其文，叹曰，子谪仙人也。言于明皇，召见金銮殿，奏颂一篇，帝赐食，亲为调羹，有诏供奉翰林。白犹与酒徒饮于巿，帝坐沈香亭子，意有所感，欲得白为乐章，召入，而白已醉，左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见，白常侍帝，醉，使高力士脱𫖇，力士素贵，耻之，摘其诗以激杨贵妃，帝欲官白，妃辄沮止，白自知不为亲近所容，恳求还山，帝赐金放还，乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐，璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之，代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。"}]
     */

    private int code;
    private String message;
    private List<ResultBean> result;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public List<ResultBean> getResult() {
        return result;
    }

    public void setResult(List<ResultBean> result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * name : 李白
         * desc : 李白，字太白，陇西成纪人，凉武昭王暠九世孙。或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心。初隐岷山，益州长史苏颋见而异之曰：“是子天才英特，可比相如。”天宝初，至长安，往见贺知章。知章见其文，叹曰：“子谪仙人也。”言于明皇，召见金銮殿，奏颂一篇。帝赐食，亲为调羹。有诏供奉翰林，白犹与酒徒饮于巿。帝坐沈香亭子，意有所感，欲得白为乐章，召入，而白已醉。左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见。白常侍帝，醉，使高力士脱𫖇。力士素贵，耻之，摘其诗以激杨贵妃。帝欲官白，妃辄沮止。白自知不为亲近所容，恳求还山。帝赐金放还，乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐。璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之。代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。 李白，字太白，陇西成纪人，凉武昭王暠九世孙，或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心。初隐岷山，益州长史苏颋见而异之曰：“是子天才英特，可比相如。”天宝初，至长安，往见贺知章。知章见其文，叹曰：“子谪仙人也。”言于明皇，召见金銮殿，奏颂一篇，帝赐食，亲为调羹，有诏供奉翰林。白犹与酒徒饮于巿，帝坐沈香亭子，意有所感，欲得白为乐章。召入，而白已醉。左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见。白常侍帝，醉，使高力士脱𫖇。力士素贵，耻之，摘其诗以激杨贵妃。帝欲官白，妃辄沮止。白自知不为亲近所容，恳求还山，帝赐金放还。乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐。璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之。代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。 李白，字太白，陇西成纪人，凉武昭王暠九世孙，或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心，初隐岷山，益州长史苏颋见而异之曰，是子天才英特，可比相如。天宝初，至长安，往见贺知章，知章见其文，叹曰，子谪仙人也。言于明皇，召见金銮殿，奏颂一篇，帝赐食，亲为调羹，有诏供奉翰林。白犹与酒徒饮于巿，帝坐沈香亭子，意有所感，欲得白为乐章，召入，而白已醉，左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见，白常侍帝，醉，使高力士脱𫖇，力士素贵，耻之，摘其诗以激杨贵妃，帝欲官白，妃辄沮止，白自知不为亲近所容，恳求还山，帝赐金放还，乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐，璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之，代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。 李白，字太白，陇西成纪人，凉武昭王暠九世孙，或曰山东人，或曰蜀人。白少有逸才，志气宏放，飘然有超世之心，初隐岷山，益州长史苏颋见而异之曰，是子天才英特，可比相如。天宝初，至长安，往见贺知章，知章见其文，叹曰，子谪仙人也。言于明皇，召见金銮殿，奏颂一篇，帝赐食，亲为调羹，有诏供奉翰林。白犹与酒徒饮于巿，帝坐沈香亭子，意有所感，欲得白为乐章，召入，而白已醉，左右以水颒面，稍解，援笔成文，婉丽精切。帝爱其才，数宴见，白常侍帝，醉，使高力士脱𫖇，力士素贵，耻之，摘其诗以激杨贵妃，帝欲官白，妃辄沮止，白自知不为亲近所容，恳求还山，帝赐金放还，乃浪迹江湖，终日沈饮。永王璘都督江陵，辟为僚佐，璘谋乱，兵败，白坐长流夜郎，会赦得还。族人阳冰为当涂令，白往依之，代宗立，以左拾遗召，而白已卒。文宗时，诏以白歌诗、裴旻剑舞、张旭草书为三绝云。集三十卷，今编诗二十五卷。
         */

        private String name;
        private String desc;

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getDesc() {
            return desc;
        }

        public void setDesc(String desc) {
            this.desc = desc;
        }
    }
}
